_posts/HMI_preparation/ASML/02_DesignPattern/dpInds.org
#+STARTUP: indent `
#+TAGS: drill(d) review(r)
* design pattern

** OnStudioOperation : the op done by ds                              :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 22:21]
   :END:
 - note : someone launch operation event and let it be affected

*** code 
 #+BEGIN_SRC org
         private void SubscribeToEvents()
         {
             DsEvents.Instance().OnStudioOperation += InterruptServices_OnStudioOperation;
         }

         private void InterruptServices_OnStudioOperation(object sender, StudioOperationArgs args)
         {
             switch (args.Operation)
             {
                 case StudioSpecialOperation.HID_FINGER_MODE:
                     if (args.State == StudioOperationState.STARTED)
                     {
                         enableDisableUIDuringHIDFingerMode(false);
                     }
                     else if (args.State == StudioOperationState.FINISHED)
                     {
                         enableDisableUIDuringHIDFingerMode(true);
                     }
                     break;
             }
         }

 #+END_SRC

** if it's called from main stream to update the ui                   :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 22:24]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         private void enableDisableUIDuringHIDFingerMode(bool enable)
         {
             if (this.InvokeRequired)
             {
                 BeginInvoke(new Action<bool>(enableDisableUIDuringHIDFingerMode), enable);
                 return;
             }

             //todo: port when need 
             //this.splitContainer1.Panel2Collapsed = !enable;
         }

 #+END_SRC

** get notice from OperationEvent to change the UI status in dashboard :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 22:26]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         private void OnStudioOperation(object sender, StudioOperationArgs args)
         {
             if (args.Operation == StudioSpecialOperation.FLASH)
             {
                 if (args.State == StudioOperationState.STARTED)
                 {
                     EnableMe(false);
                 }
                 else if (args.State == StudioOperationState.FINISHED)
                 {
                     EnableMe(true);
                 }
                 else if (args.State == StudioOperationState.ERROR)
                 {
                     EnableMe(true);
                 }
             }
             else if (args.Operation == StudioSpecialOperation.TUNING)
             {
                 if ((args.Category == StudioOperationCategory.PENTUNING) && (args.State == StudioOperationState.STARTED))
                 {
                     EnableMe(false);
                 }
                 else if ((args.Category == StudioOperationCategory.PENTUNING) && (args.State == StudioOperationState.FINISHED))
                 {
                     EnableMe(true);
                 }
             }
             else if (args.Operation == StudioSpecialOperation.PREPRODUCTION)
             {
                 if (args.State == StudioOperationState.STARTED)
                 {
                     EnableMe(false);
                 }
                 else if (args.State == StudioOperationState.FINISHED)
                 {
                     EnableMe(true);
                 }
             }
         }

 #+END_SRC

** UIEventService                                                     :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 22:44]
   :END:
 - note : 
the para of delegate function must be 
1. object sender 
2. ToolEventArgs e
*** code 
 #+BEGIN_SRC org
         public delegate void ToolValueChangedEvent(ToolEventArgs e);
         public delegate void ToolClickEvent(ToolClickEventArgs e);
         public delegate void RegisterValueChangedEvent(object sender, RegisterType type);

         public delegate void ReadAllRegistersNeededEvent(object sender);
         public delegate void DoNotReportNextFwResetEvent(object sender);

         public delegate void SolutionFileSelectionChangedEvent(object sender);
         public delegate void ActivityWindowSelectionChangedEvent(object sender, bool hasSelection);
         public delegate void StatusTextUpdateEvent(string msg, Color msgClr);
         public delegate void ProgressBarEvent(bool start);

 #+END_SRC

** delegate event function                                            :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 22:47]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public delegate void ToolValueChangedEvent(ToolEventArgs e);
         public static event ToolValueChangedEvent OnToolValueChanged;

         public static void FireToolValueChanged(ToolEventArgs e)
         {
             if (OnToolValueChanged != null)
             {
                 OnToolValueChanged(e);
             }
         }

 #+END_SRC
#+BEGIN_SRC csharp
  // usage
  // studiomain.cs
  UIEventsService.FireToolValueChanged(e);
  // what things it would do?
  // see what function is +to the delegate function
  UIEventsService.ToolValueChangedEvent += xxx
#+END_SRC

** method invoker                                                     :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 22:55]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public static event MethodInvoker OnSolutionOpen;

         public static event MethodInvoker OnSolutionClosing;

         public static event MethodInvoker OnSolutionClosed;

 #+END_SRC

** StudioEventService                                                 :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 22:58]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public static IAsyncResult FireConnectionModeChanged(object sender, StatusEnum state)
         {
             ConnectionModeEvent connectionModeDelegate = FireSyncConnectionModeChanged;
             return connectionModeDelegate.BeginInvoke(sender, state, null, null);
         }

 #+END_SRC

** get InvocationList                                                 :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:00]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public static void FireSyncConnectionModeChanged(object sender, StatusEnum state)
         {
             L12n.UseInvariantCulture();

             ConnectionModeEvent handler = OnConnectionModeChanged;
             if (handler != null)
             {
                 foreach (ConnectionModeEvent f in handler.GetInvocationList())
                 {
                     try
                     {
                         f(sender, state);
                     }
                     catch (Exception ex)
                     {
                         DsMessage.FireOnMessage(StudioPackageType.Biz, StudioMessageType.Error,
                             "FireConnectionModeEvent" + ":" + ex.Message);
                         Logger.WriteError("FireConnectionModeEvent" + ": " + ex.Message + " : " + ex.StackTrace);
                     }
                 }
             }
         }

 #+END_SRC

** get resources from resource manager                                :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:03]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                 _resMgr = new ResMan("Synaptics.DSNG.UI.Res", Assembly.GetExecutingAssembly());

 #+END_SRC

** get/set F11Touchpad in solutionFacade                              :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:15]
   :END:
 - note : 
