_posts/HMI_preparation/ASML/02_DesignPattern/dpInds.tex
% Created 2019-03-19 二 21:17
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{raflin}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={raflin},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.1.13)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{design pattern}
\label{sec:orgb024300}

\subsection{OnStudioOperation : the op done by ds\hfill{}\textsc{drill}}
\label{sec:orged89243}
\begin{itemize}
\item note : someone launch operation event and let it be affected
\end{itemize}

\subsubsection{code}
\label{sec:org90231f3}
\begin{verbatim}
private void SubscribeToEvents()
{
    DsEvents.Instance().OnStudioOperation += InterruptServices_OnStudioOperation;
}

private void InterruptServices_OnStudioOperation(object sender, StudioOperationArgs args)
{
    switch (args.Operation)
    {
        case StudioSpecialOperation.HID_FINGER_MODE:
            if (args.State == StudioOperationState.STARTED)
            {
                enableDisableUIDuringHIDFingerMode(false);
            }
            else if (args.State == StudioOperationState.FINISHED)
            {
                enableDisableUIDuringHIDFingerMode(true);
            }
            break;
    }
}

\end{verbatim}

\subsection{if it's called from main stream to update the ui\hfill{}\textsc{drill}}
\label{sec:org00471d6}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org228cd63}
\begin{verbatim}
private void enableDisableUIDuringHIDFingerMode(bool enable)
{
    if (this.InvokeRequired)
    {
        BeginInvoke(new Action<bool>(enableDisableUIDuringHIDFingerMode), enable);
        return;
    }

    //todo: port when need 
    //this.splitContainer1.Panel2Collapsed = !enable;
}

\end{verbatim}

\subsection{get notice from OperationEvent to change the UI status in dashboard\hfill{}\textsc{drill}}
\label{sec:org13e71cc}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org93a8f9d}
\begin{verbatim}
private void OnStudioOperation(object sender, StudioOperationArgs args)
{
    if (args.Operation == StudioSpecialOperation.FLASH)
    {
        if (args.State == StudioOperationState.STARTED)
        {
            EnableMe(false);
        }
        else if (args.State == StudioOperationState.FINISHED)
        {
            EnableMe(true);
        }
        else if (args.State == StudioOperationState.ERROR)
        {
            EnableMe(true);
        }
    }
    else if (args.Operation == StudioSpecialOperation.TUNING)
    {
        if ((args.Category == StudioOperationCategory.PENTUNING) && (args.State == StudioOperationState.STARTED))
        {
            EnableMe(false);
        }
        else if ((args.Category == StudioOperationCategory.PENTUNING) && (args.State == StudioOperationState.FINISHED))
        {
            EnableMe(true);
        }
    }
    else if (args.Operation == StudioSpecialOperation.PREPRODUCTION)
    {
        if (args.State == StudioOperationState.STARTED)
        {
            EnableMe(false);
        }
        else if (args.State == StudioOperationState.FINISHED)
        {
            EnableMe(true);
        }
    }
}

\end{verbatim}

\subsection{UIEventService\hfill{}\textsc{drill}}
\label{sec:org779b3cc}
\begin{itemize}
\item note :
\end{itemize}
the para of delegate function must be 
\begin{enumerate}
\item object sender
\item ToolEventArgs e
\end{enumerate}
\subsubsection{code}
\label{sec:org996746b}
\begin{verbatim}
public delegate void ToolValueChangedEvent(ToolEventArgs e);
public delegate void ToolClickEvent(ToolClickEventArgs e);
public delegate void RegisterValueChangedEvent(object sender, RegisterType type);

public delegate void ReadAllRegistersNeededEvent(object sender);
public delegate void DoNotReportNextFwResetEvent(object sender);

public delegate void SolutionFileSelectionChangedEvent(object sender);
public delegate void ActivityWindowSelectionChangedEvent(object sender, bool hasSelection);
public delegate void StatusTextUpdateEvent(string msg, Color msgClr);
public delegate void ProgressBarEvent(bool start);

\end{verbatim}

\subsection{delegate event function\hfill{}\textsc{drill}}
\label{sec:orgf53dddc}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:orge569423}
\begin{verbatim}
public delegate void ToolValueChangedEvent(ToolEventArgs e);
public static event ToolValueChangedEvent OnToolValueChanged;

public static void FireToolValueChanged(ToolEventArgs e)
{
    if (OnToolValueChanged != null)
    {
        OnToolValueChanged(e);
    }
}

\end{verbatim}
\begin{verbatim}
// usage
// studiomain.cs
UIEventsService.FireToolValueChanged(e);
// what things it would do?
// see what function is +to the delegate function
UIEventsService.ToolValueChangedEvent += xxx
\end{verbatim}

\subsection{method invoker\hfill{}\textsc{drill}}
\label{sec:orgd53d5ce}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org27f57b0}
\begin{verbatim}
public static event MethodInvoker OnSolutionOpen;

public static event MethodInvoker OnSolutionClosing;

public static event MethodInvoker OnSolutionClosed;

\end{verbatim}

\subsection{StudioEventService\hfill{}\textsc{drill}}
\label{sec:org0fd6efc}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:orgb16ec1f}
\begin{verbatim}
public static IAsyncResult FireConnectionModeChanged(object sender, StatusEnum state)
{
    ConnectionModeEvent connectionModeDelegate = FireSyncConnectionModeChanged;
    return connectionModeDelegate.BeginInvoke(sender, state, null, null);
}

\end{verbatim}

\subsection{get InvocationList\hfill{}\textsc{drill}}
\label{sec:orgfed0143}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org22fae31}
\begin{verbatim}
public static void FireSyncConnectionModeChanged(object sender, StatusEnum state)
{
    L12n.UseInvariantCulture();

    ConnectionModeEvent handler = OnConnectionModeChanged;
    if (handler != null)
    {
        foreach (ConnectionModeEvent f in handler.GetInvocationList())
        {
            try
            {
                f(sender, state);
            }
            catch (Exception ex)
            {
                DsMessage.FireOnMessage(StudioPackageType.Biz, StudioMessageType.Error,
                    "FireConnectionModeEvent" + ":" + ex.Message);
                Logger.WriteError("FireConnectionModeEvent" + ": " + ex.Message + " : " + ex.StackTrace);
            }
        }
    }
}

\end{verbatim}

\subsection{get resources from resource manager\hfill{}\textsc{drill}}
\label{sec:orga46b606}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org51185a7}
\begin{verbatim}
_resMgr = new ResMan("Synaptics.DSNG.UI.Res", Assembly.GetExecutingAssembly());

\end{verbatim}

\subsection{get/set F11Touchpad in solutionFacade\hfill{}\textsc{drill}}
\label{sec:orgfe7e065}
\begin{itemize}
\item note :
\end{itemize}
