_posts/HMI_preparation/ASML/02_DesignPattern/dpInds.org
*** code 
 #+BEGIN_SRC org
// dp : fly weight
        [XmlElement("Touchpads", typeof(F11TouchpadItem))]
        public List<F11TouchpadItem> Touchpads { get; set; }

         public F11TouchpadItem GetTouchpad()
         {
             DesignLayout layout = StudioSolutionManager.Instance.Experiment.Layout;
             if (layout.Touchpads.Count() == 0)
             {
                 layout.Touchpads.Add(new F11TouchpadItem());
             }
             return layout.Touchpads[0];
         }

         public F11TouchpadItem GetTouchpad(string name)
         {
             DesignLayout layout = StudioSolutionManager.Instance.Experiment.Layout;
             F11TouchpadItem result = layout.Touchpads.FirstOrDefault(item => item.ItemName.Equals(name));
             if (result == null)
             {
                 result = new F11TouchpadItem { ItemName = name };
                 layout.Touchpads.Add(result);
             }
             return result;
         }

         public void SetTouchpad(F11TouchpadItem item)
         {
             DesignLayout layout = StudioSolutionManager.Instance.Experiment.Layout;
             layout.Touchpads.RemoveAll(x => x.ItemName == item.ItemName);
             layout.Touchpads.Add(item);
         }

 #+END_SRC

** gethashcode template                                               :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:19]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public override int GetHashCode()
         {
             unchecked
             {
                 int result = base.GetHashCode();
                 result = (result * 397) ^ (XSensorMap != null ? CollectionIdentity.GetHashCode(XSensorMap) : 0);
                 result = (result * 397) ^ (YSensorMap != null ? CollectionIdentity.GetHashCode(YSensorMap) : 0);
                 result = (result * 397) ^ (XSensitivities != null ? CollectionIdentity.GetHashCode(XSensitivities) : 0);
                 result = (result * 397) ^ (YSensitivities != null ? CollectionIdentity.GetHashCode(YSensitivities) : 0);
                 result = (result * 397) ^ VisualFeedback.GetHashCode();
                 result = (result * 397) ^ Orientation.GetHashCode();
                 result = (result * 397) ^ Origin.GetHashCode();
                 result = (result * 397) ^ FingerDimension.GetHashCode();
                 result = (result * 397) ^ XScalingFactor.GetHashCode();
                 result = (result * 397) ^ YScalingFactor.GetHashCode();
                 result = (result * 397) ^ TouchPadScale.GetHashCode();
                 result = (result * 397) ^ ActivePenInkingWidth.GetHashCode();
                 return result;
             }
         }

 #+END_SRC

** restore layout from xml file                                       :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:22]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public void RestoreLayout()
         {
             try
             {
                 if (File.Exists(Application.StartupPath + "\\" + "DashboardLayout.xml"))
                 {
                     using (var reader = new StreamReader(Application.StartupPath + "\\" + "DashboardLayout.xml"))
                     {
                         var gp = (GroupProperty)new XmlSerializer(typeof(GroupProperty)).Deserialize(reader);
                         this.ultraExplorerBarDashboard.NavigationMaxGroupHeaders = gp.MaxGroupHeaderValue;
                         foreach (GroupValue gv in gp.GroupSetting)
                         {
                             int grpId = this.ultraExplorerBarDashboard.Groups.IndexOf(gv.Name);
                             if (0 <= grpId)
                             {
                                 UltraExplorerBarGroup g =
                                     this.ultraExplorerBarDashboard.Groups[gv.Name];
                                 if (g != null)
                                 {
                                     g.Visible = gv.Visible;
                                 }
                             }
                         }
                         IComparer myComparer = new myReverserClass(gp.GroupSetting);
                         this.ultraExplorerBarDashboard.Groups.Sort(myComparer);
                     }
                 }
             }
             catch (Exception ex)
             {
                 DsMessage.FireOnMessage(StudioPackageType.Ui, StudioMessageType.Error, "Dashboard: " + ex.Message);
             }
         }

 #+END_SRC

** save layout                                                        :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:24]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public void SaveLayout()
         {
             try
             {
                 using (StreamWriter writer = new StreamWriter(Application.StartupPath + "\\" + "DashboardLayout.xml"))
                 {
                     GroupProperty gp = new GroupProperty();
                     gp.MaxGroupHeaderValue = this.ultraExplorerBarDashboard.NavigationMaxGroupHeaders;
                     foreach (UltraExplorerBarGroup group in this.ultraExplorerBarDashboard.Groups)
                     {
                         gp.GroupSetting.Add(new GroupValue(group.Key, group.Index, group.Visible));
                     }
                     new XmlSerializer(typeof(GroupProperty)).Serialize(writer, gp);
                 }
             }
             catch
             {
                 DsMessage.FireOnMessage(StudioPackageType.Ui, StudioMessageType.Error,
                     "Can't save the Dashboard layout.");
             }
         }

 #+END_SRC

** list firstOrDefault                                                :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:24]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                 xIndex = _GroupValueList.FirstOrDefault(g => g.Name == ((UltraExplorerBarGroup)x).Key).Index;
                 yIndex = _GroupValueList.FirstOrDefault(g => g.Name == ((UltraExplorerBarGroup)y).Key).Index; ;

 #+END_SRC

** serrialize                                                         :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:26]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
     [Serializable]
     public class GroupValue
     {
         [XmlElement("Name")]
         public string Name;
         [XmlElement("Index")]
         public int Index;
         [XmlElement("Visible")]
         public bool Visible;

         public GroupValue()
         {
         }

         public GroupValue(string name, int index, bool visible)
         {
             Name = name;
             Index = index;
             Visible = visible;
         }
     }

     [Serializable]
     [XmlInclude(typeof(GroupValue))]
     public class GroupProperty
     {
         private List<GroupValue> _groupsetting = new List<GroupValue>();
         public int MaxGroupHeaderValue { get; set; }

         [XmlElement("GroupSetting")]
         public List<GroupValue> GroupSetting
         {
             get { return _groupsetting; }
             set { _groupsetting = value; }
         }
     }

 #+END_SRC

** sort csv by list                                                   :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:28]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         private string SortCsv(string csv)
         {
             List<string> items = new List<string>();

             string[] strTokens = csv.Split(new char[] { ',' });
             foreach (string item in strTokens)
             {
                 items.Add(item);
             }
             items.Sort();

             string output = string.Empty;
             foreach (string item in items)
             {
                 output += item + ",";
             }

             if (output != string.Empty)
             {
                 // Remove the trailing ","
                 output = output.Substring(0, output.Length - 1);
             }
             return output;
         }

 #+END_SRC

** get flash identify value in dashboard                              :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:31]
   :END:
 - note : 
