_posts/HMI_preparation/ASML/02_DesignPattern/dpInds.org
*** code 
 #+BEGIN_SRC org
             ReflashParameters reflashParam = new ReflashParameters(
                 SolutionDataFacade.Instance.GetDeviceProtocol(),
                 SolutionDataFacade.Instance.GetHostInfo());

             reflashParam.MPCSerialNumber = serial;

             touchModuleInfo tInfo = null;

             Dictionary<ReflashInfoBase.InfoKey, string> touchModInfo =
                 FWMamager.Instance().FirmwareInfo(reflashParam);

 #+END_SRC

** throw exception in func                                            :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:34]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                         if (serialNumber == "")
                             throw new Exception("Can't find Serial Number of MPC");
                         else
                             throw new Exception(string.Format("Can't find MPC of serial number {0}", serialNumber));

 #+END_SRC

** singleton                                                          :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:36]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public static DashBoardController GetInstance()
         {
             if (theCtrler == null)
             {
                 theCtrler = new DashBoardController();
             }
             return theCtrler;
         }

         private static DashBoardController theCtrler = null;

 #+END_SRC

** read interrupt status                                              :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:38]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public ulong CommandReadInterruptStatus()
         {
             try
             {
                 var f01Helper = RMIFunctionFacade.Instance._helpersFromDevi.GetF01Helper();
                 if (f01Helper != null)
                 {
                     return f01Helper.GetInterrupt(true);
                 }
             }
             catch (DsException ex)
             {
                 DsMessage.FireOnMessage(StudioPackageType.Ui, StudioMessageType.Error, "Dashboard: " + ex.Message);
             }
             return ulong.MaxValue;
         }

 #+END_SRC

** mvc, controller get data from RMIFacade                            :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:38]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public byte GetSleepMode()
         {
             return RMIFunctionFacade.Instance.GetSleepMode();
         }

 #+END_SRC

** mvc, view : get notice from observer and get value from controller :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:53]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
        private void UpdateControlRegisterValues()
 #+END_SRC

** launch one UIservice to notify other UI                            :drill:
   :PROPERTIES:
   :DATE:     [2017-09-23 Sat 23:55]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         private void ButtonForceUpdateClick(object sender, EventArgs e)
         {
             buttonForceUpdate.Enabled = false;
             _Controller.SetForceUpdate();
             buttonForceUpdate.Enabled = true;
             // Bring back input focus, otherwise, the input focus go to the next control in the tab order.
             buttonForceUpdate.Focus();
             UIEventsService.FireExecuteDashboardCommandDuringDiagnostic();
         }

 #+END_SRC

** another way to read resiter by _deviceHelper                       :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 00:01]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                 _DeviceHelper.Read(0x1, RegisterTypeEnum.Data, 0, GetData(0x1));
                 return _F01.GetInterrupt(false);

 #+END_SRC

** RunTimeState : get status update from OnStudioOperation            :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 12:31]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         private void OnStudioOperation(object sender, StudioOperationArgs args)

 #+END_SRC

** RMIFunctionFacade, helper from solution.instance.registermap       :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 12:35]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
             _helpersFromSoln = new HelpersFromSolution();
             _f01Hlpr = new RMIFunction01Helper(StudioSolutionManager.Instance.RegisterMap);

 #+END_SRC

** RMIFunctionFacade from device                                      :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 12:37]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
             _helpersFromDevi = new HelpersFromDevice();
             _f21Helper = new RMIFunction21Helper();

 #+END_SRC

** fire Studio Operation example                                      :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 12:40]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                 DsEvents.Instance().FireStudioOperation(this, new StudioOperationArgs(StudioSpecialOperation.RAMUNLOCK, StudioOperationState.STARTED));

 #+END_SRC

** Ilist example                                                      :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 12:46]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public IList<RegisterInfo> FindRegistersByAddr(IList<ushort> addrList)
         {
             Debug.Assert(addrList != null);
             RegisterMap map = GetCurrentRegisterMap();
             if (map == null)
             {
                 return null;
             }
             RegisterMapHelper helper = new RegisterMapHelper(map);
             return addrList.Select(addr => helper.FindByAddress(addr)).ToList();
         }

         public IList<RegisterInfo> GetAllControlRegisters()
         {
             return _RegisterMap.AllRegisters.Where(reg => reg.Type == RegisterTypeEnum.Control).ToList();
         }

 #+END_SRC

** Ilist example : sortby                                             :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 12:50]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
             List<RegisterInfo> regs = map.AllRegisters.Where(x => x.Type == RegisterTypeEnum.Control).OrderBy(x => x.Address).ToList();

 #+END_SRC

** list find                                                          :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 13:03]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public SolutionFileInfo Find(string name)
         {
             return All.Find(e => e.Name == name);
         }

         public SolutionFileInfo FindFileName(string name)
         {

             return All.Find(e => (e.LinkFileInfo != null) && (e.LinkFileInfo.Name == name));
         }

 #+END_SRC

** ctor                                                               :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 13:18]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         public StudioSolution(StudioProject project)
         {
             Project = project;
             Files = new SolutionFiles();
             FwReqDataChanged = false;
         }

         public StudioSolution() : this(null)
         {
         }

 #+END_SRC

** copy ctor : copy one instance into this                            :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 13:44]
   :END:
 - note : 
