_posts/HMI_preparation/ASML/02_DesignPattern/dpInds.tex
\subsubsection{code}
\label{sec:orgc8888e0}
\begin{verbatim}
ReflashParameters reflashParam = new ReflashParameters(
    SolutionDataFacade.Instance.GetDeviceProtocol(),
    SolutionDataFacade.Instance.GetHostInfo());

reflashParam.MPCSerialNumber = serial;

touchModuleInfo tInfo = null;

Dictionary<ReflashInfoBase.InfoKey, string> touchModInfo =
    FWMamager.Instance().FirmwareInfo(reflashParam);

\end{verbatim}

\subsection{throw exception in func\hfill{}\textsc{drill}}
\label{sec:org8a8bf04}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org2b2b7c2}
\begin{verbatim}
if (serialNumber == "")
    throw new Exception("Can't find Serial Number of MPC");
else
    throw new Exception(string.Format("Can't find MPC of serial number {0}", serialNumber));

\end{verbatim}

\subsection{singleton\hfill{}\textsc{drill}}
\label{sec:orgbfc4b57}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org39dcb01}
\begin{verbatim}
public static DashBoardController GetInstance()
{
    if (theCtrler == null)
    {
        theCtrler = new DashBoardController();
    }
    return theCtrler;
}

private static DashBoardController theCtrler = null;

\end{verbatim}

\subsection{read interrupt status\hfill{}\textsc{drill}}
\label{sec:org99a64af}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org183e090}
\begin{verbatim}
public ulong CommandReadInterruptStatus()
{
    try
    {
        var f01Helper = RMIFunctionFacade.Instance._helpersFromDevi.GetF01Helper();
        if (f01Helper != null)
        {
            return f01Helper.GetInterrupt(true);
        }
    }
    catch (DsException ex)
    {
        DsMessage.FireOnMessage(StudioPackageType.Ui, StudioMessageType.Error, "Dashboard: " + ex.Message);
    }
    return ulong.MaxValue;
}

\end{verbatim}

\subsection{mvc, controller get data from RMIFacade\hfill{}\textsc{drill}}
\label{sec:org25e887a}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:orgd36f386}
\begin{verbatim}
public byte GetSleepMode()
{
    return RMIFunctionFacade.Instance.GetSleepMode();
}

\end{verbatim}

\subsection{mvc, view : get notice from observer and get value from controller\hfill{}\textsc{drill}}
\label{sec:orgb30bc20}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:orgc67818f}
\begin{verbatim}
private void UpdateControlRegisterValues()
\end{verbatim}

\subsection{launch one UIservice to notify other UI\hfill{}\textsc{drill}}
\label{sec:org3901b46}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org2e325b9}
\begin{verbatim}
private void ButtonForceUpdateClick(object sender, EventArgs e)
{
    buttonForceUpdate.Enabled = false;
    _Controller.SetForceUpdate();
    buttonForceUpdate.Enabled = true;
    // Bring back input focus, otherwise, the input focus go to the next control in the tab order.
    buttonForceUpdate.Focus();
    UIEventsService.FireExecuteDashboardCommandDuringDiagnostic();
}

\end{verbatim}

\subsection{another way to read resiter by \_deviceHelper\hfill{}\textsc{drill}}
\label{sec:org1b41168}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org23779a7}
\begin{verbatim}
_DeviceHelper.Read(0x1, RegisterTypeEnum.Data, 0, GetData(0x1));
return _F01.GetInterrupt(false);

\end{verbatim}

\subsection{RunTimeState : get status update from OnStudioOperation\hfill{}\textsc{drill}}
\label{sec:org00deafa}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:orgdc20aa7}
\begin{verbatim}
private void OnStudioOperation(object sender, StudioOperationArgs args)

\end{verbatim}

\subsection{RMIFunctionFacade, helper from solution.instance.registermap\hfill{}\textsc{drill}}
\label{sec:org8fba295}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org93e818a}
\begin{verbatim}
_helpersFromSoln = new HelpersFromSolution();
_f01Hlpr = new RMIFunction01Helper(StudioSolutionManager.Instance.RegisterMap);

\end{verbatim}

\subsection{RMIFunctionFacade from device\hfill{}\textsc{drill}}
\label{sec:org20725c2}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org60ba616}
\begin{verbatim}
_helpersFromDevi = new HelpersFromDevice();
_f21Helper = new RMIFunction21Helper();

\end{verbatim}

\subsection{fire Studio Operation example\hfill{}\textsc{drill}}
\label{sec:org2694ee8}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org76b4f45}
\begin{verbatim}
DsEvents.Instance().FireStudioOperation(this, new StudioOperationArgs(StudioSpecialOperation.RAMUNLOCK, StudioOperationState.STARTED));

\end{verbatim}

\subsection{Ilist example\hfill{}\textsc{drill}}
\label{sec:org6120381}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org8cc2104}
\begin{verbatim}
public IList<RegisterInfo> FindRegistersByAddr(IList<ushort> addrList)
{
    Debug.Assert(addrList != null);
    RegisterMap map = GetCurrentRegisterMap();
    if (map == null)
    {
        return null;
    }
    RegisterMapHelper helper = new RegisterMapHelper(map);
    return addrList.Select(addr => helper.FindByAddress(addr)).ToList();
}

public IList<RegisterInfo> GetAllControlRegisters()
{
    return _RegisterMap.AllRegisters.Where(reg => reg.Type == RegisterTypeEnum.Control).ToList();
}

\end{verbatim}

\subsection{Ilist example : sortby\hfill{}\textsc{drill}}
\label{sec:orgfb1676b}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org794a83a}
\begin{verbatim}
List<RegisterInfo> regs = map.AllRegisters.Where(x => x.Type == RegisterTypeEnum.Control).OrderBy(x => x.Address).ToList();

\end{verbatim}

\subsection{list find\hfill{}\textsc{drill}}
\label{sec:orgf965b92}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org008d263}
\begin{verbatim}
public SolutionFileInfo Find(string name)
{
    return All.Find(e => e.Name == name);
}

public SolutionFileInfo FindFileName(string name)
{

    return All.Find(e => (e.LinkFileInfo != null) && (e.LinkFileInfo.Name == name));
}

\end{verbatim}

\subsection{ctor\hfill{}\textsc{drill}}
\label{sec:org9ef499f}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:orga6dc128}
\begin{verbatim}
public StudioSolution(StudioProject project)
{
    Project = project;
    Files = new SolutionFiles();
    FwReqDataChanged = false;
}

public StudioSolution() : this(null)
{
}

\end{verbatim}

\subsection{copy ctor : copy one instance into this\hfill{}\textsc{drill}}
\label{sec:org3e0dc16}
\begin{itemize}
\item note :
\end{itemize}
