_posts/HMI_preparation/ASML/02_DesignPattern/dpInds.org
*** code 
 #+BEGIN_SRC org
         /// <summary>
         /// Copy constructor
         /// </summary>
         /// <param name="src"></param>
         public RegisterMap(RegisterMap src)
             : this(src.Name)
         {
             Copy(src);
         }

         private void Copy(RegisterMap src)
         {
             foreach (RegisterInfo registerInfo in src.AllRegisters)
             {
                 PacketRegisterInfo packet = registerInfo as PacketRegisterInfo;
                 if (packet != null)
                 {
                     AllRegisters.Add(new PacketRegisterInfo(packet));
                 }
                 else
                 {
                     AllRegisters.Add(new RegisterInfo(registerInfo));
                 }
             }
             InterruptMasks.Clear();
             foreach (KeyValuePair<byte, ulong> interruptMask in src.InterruptMasks)
             {
                 InterruptMasks.Add(interruptMask.Key, interruptMask.Value);
             }
             FunctionRevisions.Clear();
             foreach (KeyValuePair<byte, byte> functionRevision in src.FunctionRevisions)
             {
                 FunctionRevisions.Add(functionRevision.Key, functionRevision.Value);
             }
             IsFunctionPublicFlags.Clear();
             foreach (KeyValuePair<byte, bool> pubflag in src.IsFunctionPublicFlags)
             {
                 IsFunctionPublicFlags.Add(pubflag.Key, pubflag.Value);
             }
         }

 #+END_SRC

** Clone for RegisterMap                                              :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 13:45]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         /// <summary>
         /// Default constructor
         /// </summary>
         public RegisterMap()
             : this("Master")
         {
         }

         public RegisterMap Clone()
         {
             return new RegisterMap(this);
         }

 #+END_SRC

** list where and select                                              :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 13:47]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
         /// <summary>
         /// All packet registers
         /// </summary>
         [XmlIgnore]
         public List<PacketRegisterInfo> PacketRegisters
         {
             get { return AllRegisters.Where(x => x is PacketRegisterInfo).Select(x => (PacketRegisterInfo)x).ToList(); }
         }

 #+END_SRC

** KeyValuePair                                                       :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 13:51]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
             foreach (KeyValuePair<byte, ulong> inter in interrupts)
             {
                 InterruptMasks.Add(inter.Key, inter.Value);
             }
             foreach (KeyValuePair<byte, byte> revision in functionRevision)
             {
                 FunctionRevisions.Add(revision.Key, revision.Value);
             }
             foreach (KeyValuePair<byte, bool> isPubFlag in functionPublicFlags)
             {
                 IsFunctionPublicFlags.Add(isPubFlag.Key, isPubFlag.Value);
             }

 #+END_SRC

** get Enumerator                                                     :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 13:53]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                         var e = registersInfo.Values.GetEnumerator();
                         e.MoveNext();
                         return e.Current;

 #+END_SRC

** enumerator                                                         :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 13:54]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                     var eNumber = registerCollection.Values.GetEnumerator();
                     eNumber.MoveNext();
                     var eSubNumber = eNumber.Current.GetEnumerator();
                     eSubNumber.MoveNext();
                     return AllRegisters[eSubNumber.Current.Value];

 #+END_SRC

** dispose example                                                    :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 14:01]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                     var eNumber = registerCollection.Values.GetEnumerator();
                     eNumber.MoveNext();
                     var eSubNumber = eNumber.Current.GetEnumerator();
                     eSubNumber.MoveNext();
                     return AllRegisters[eSubNumber.Current.Value];

 #+END_SRC

** InterruptService : how to get int from dev                         :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 14:20]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                     var eNumber = registerCollection.Values.GetEnumerator();
                     eNumber.MoveNext();
                     var eSubNumber = eNumber.Current.GetEnumerator();
                     eSubNumber.MoveNext();
                     return AllRegisters[eSubNumber.Current.Value];

 #+END_SRC

** get data from device.instance                                      :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 14:21]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                     var eNumber = registerCollection.Values.GetEnumerator();
                     eNumber.MoveNext();
                     var eSubNumber = eNumber.Current.GetEnumerator();
                     eSubNumber.MoveNext();
                     return AllRegisters[eSubNumber.Current.Value];

 #+END_SRC

** read interrupt by _deviceHelper                                    :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 14:28]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                     var eNumber = registerCollection.Values.GetEnumerator();
                     eNumber.MoveNext();
                     var eSubNumber = eNumber.Current.GetEnumerator();
                     eSubNumber.MoveNext();
                     return AllRegisters[eSubNumber.Current.Value];

 #+END_SRC

** open external log                                                  :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 14:30]
   :END:
 - note : 
*** code 
 #+BEGIN_SRC org
                     var eNumber = registerCollection.Values.GetEnumerator();
                     eNumber.MoveNext();
                     var eSubNumber = eNumber.Current.GetEnumerator();
                     eSubNumber.MoveNext();
                     return AllRegisters[eSubNumber.Current.Value];

 #+END_SRC

** instance lock                                                      :drill:
   :PROPERTIES:
   :DATE:     [2017-09-24 Sun 14:35]
   :END:
 - note :
 - https://dotblogs.com.tw/yc421206/2011/01/07/20624
*** code 
 #+BEGIN_SRC org
                     var eNumber = registerCollection.Values.GetEnumerator();
                     eNumber.MoveNext();
                     var eSubNumber = eNumber.Current.GetEnumerator();
                     eSubNumber.MoveNext();
                     return AllRegisters[eSubNumber.Current.Value];

 #+END_SRC

** method invoker                                                    :drill:
:PROPERTIES:
:DATE: [2017-09-26 Tue 14:32]
:END:
- note : 
*** code 
#+BEGIN_SRC org
        internal void ChangeStartStop()
        {
            MethodInvoker f;
            if (IsRunning)
            {
                f = Stop;
            }
            else
            {
                PreProcessForStart();
                f = () => Start(false);
            }
            f.BeginInvoke(null, null);
        }

#+END_SRC

