_posts/HMI_preparation/ASML/02_DesignPattern/dpInds.tex
\subsubsection{code}
\label{sec:org0d9914c}
\begin{verbatim}
/// <summary>
/// Copy constructor
/// </summary>
/// <param name="src"></param>
public RegisterMap(RegisterMap src)
    : this(src.Name)
{
    Copy(src);
}

private void Copy(RegisterMap src)
{
    foreach (RegisterInfo registerInfo in src.AllRegisters)
    {
        PacketRegisterInfo packet = registerInfo as PacketRegisterInfo;
        if (packet != null)
        {
            AllRegisters.Add(new PacketRegisterInfo(packet));
        }
        else
        {
            AllRegisters.Add(new RegisterInfo(registerInfo));
        }
    }
    InterruptMasks.Clear();
    foreach (KeyValuePair<byte, ulong> interruptMask in src.InterruptMasks)
    {
        InterruptMasks.Add(interruptMask.Key, interruptMask.Value);
    }
    FunctionRevisions.Clear();
    foreach (KeyValuePair<byte, byte> functionRevision in src.FunctionRevisions)
    {
        FunctionRevisions.Add(functionRevision.Key, functionRevision.Value);
    }
    IsFunctionPublicFlags.Clear();
    foreach (KeyValuePair<byte, bool> pubflag in src.IsFunctionPublicFlags)
    {
        IsFunctionPublicFlags.Add(pubflag.Key, pubflag.Value);
    }
}

\end{verbatim}

\subsection{Clone for RegisterMap\hfill{}\textsc{drill}}
\label{sec:org6f0e972}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org007c421}
\begin{verbatim}
/// <summary>
/// Default constructor
/// </summary>
public RegisterMap()
    : this("Master")
{
}

public RegisterMap Clone()
{
    return new RegisterMap(this);
}

\end{verbatim}

\subsection{list where and select\hfill{}\textsc{drill}}
\label{sec:org58cf0ac}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org9fdfe5c}
\begin{verbatim}
/// <summary>
/// All packet registers
/// </summary>
[XmlIgnore]
public List<PacketRegisterInfo> PacketRegisters
{
    get { return AllRegisters.Where(x => x is PacketRegisterInfo).Select(x => (PacketRegisterInfo)x).ToList(); }
}

\end{verbatim}

\subsection{KeyValuePair\hfill{}\textsc{drill}}
\label{sec:org0ee50df}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org89800a9}
\begin{verbatim}
foreach (KeyValuePair<byte, ulong> inter in interrupts)
{
    InterruptMasks.Add(inter.Key, inter.Value);
}
foreach (KeyValuePair<byte, byte> revision in functionRevision)
{
    FunctionRevisions.Add(revision.Key, revision.Value);
}
foreach (KeyValuePair<byte, bool> isPubFlag in functionPublicFlags)
{
    IsFunctionPublicFlags.Add(isPubFlag.Key, isPubFlag.Value);
}

\end{verbatim}

\subsection{get Enumerator\hfill{}\textsc{drill}}
\label{sec:org364c02a}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:orgc338452}
\begin{verbatim}
var e = registersInfo.Values.GetEnumerator();
e.MoveNext();
return e.Current;

\end{verbatim}

\subsection{enumerator\hfill{}\textsc{drill}}
\label{sec:org37a8e6a}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:orgf0237e5}
\begin{verbatim}
var eNumber = registerCollection.Values.GetEnumerator();
eNumber.MoveNext();
var eSubNumber = eNumber.Current.GetEnumerator();
eSubNumber.MoveNext();
return AllRegisters[eSubNumber.Current.Value];

\end{verbatim}

\subsection{dispose example\hfill{}\textsc{drill}}
\label{sec:org703f744}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org73f0736}
\begin{verbatim}
var eNumber = registerCollection.Values.GetEnumerator();
eNumber.MoveNext();
var eSubNumber = eNumber.Current.GetEnumerator();
eSubNumber.MoveNext();
return AllRegisters[eSubNumber.Current.Value];

\end{verbatim}

\subsection{InterruptService : how to get int from dev\hfill{}\textsc{drill}}
\label{sec:orgb6d9909}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org7723626}
\begin{verbatim}
var eNumber = registerCollection.Values.GetEnumerator();
eNumber.MoveNext();
var eSubNumber = eNumber.Current.GetEnumerator();
eSubNumber.MoveNext();
return AllRegisters[eSubNumber.Current.Value];

\end{verbatim}

\subsection{get data from device.instance\hfill{}\textsc{drill}}
\label{sec:org396d1eb}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:orgec638a7}
\begin{verbatim}
var eNumber = registerCollection.Values.GetEnumerator();
eNumber.MoveNext();
var eSubNumber = eNumber.Current.GetEnumerator();
eSubNumber.MoveNext();
return AllRegisters[eSubNumber.Current.Value];

\end{verbatim}

\subsection{read interrupt by \_deviceHelper\hfill{}\textsc{drill}}
\label{sec:org8c07efc}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org504a389}
\begin{verbatim}
var eNumber = registerCollection.Values.GetEnumerator();
eNumber.MoveNext();
var eSubNumber = eNumber.Current.GetEnumerator();
eSubNumber.MoveNext();
return AllRegisters[eSubNumber.Current.Value];

\end{verbatim}

\subsection{open external log\hfill{}\textsc{drill}}
\label{sec:orgdebc8d5}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:org2f78e9d}
\begin{verbatim}
var eNumber = registerCollection.Values.GetEnumerator();
eNumber.MoveNext();
var eSubNumber = eNumber.Current.GetEnumerator();
eSubNumber.MoveNext();
return AllRegisters[eSubNumber.Current.Value];

\end{verbatim}

\subsection{instance lock\hfill{}\textsc{drill}}
\label{sec:orga7be6bf}
\begin{itemize}
\item note :
\item \url{https://dotblogs.com.tw/yc421206/2011/01/07/20624}
\end{itemize}
\subsubsection{code}
\label{sec:orgb719164}
\begin{verbatim}
var eNumber = registerCollection.Values.GetEnumerator();
eNumber.MoveNext();
var eSubNumber = eNumber.Current.GetEnumerator();
eSubNumber.MoveNext();
return AllRegisters[eSubNumber.Current.Value];

\end{verbatim}

\subsection{method invoker\hfill{}\textsc{drill}}
\label{sec:orgdea61ef}
\begin{itemize}
\item note :
\end{itemize}
\subsubsection{code}
\label{sec:orgb9febc6}
\begin{verbatim}
internal void ChangeStartStop()
{
    MethodInvoker f;
    if (IsRunning)
    {
        f = Stop;
    }
    else
    {
        PreProcessForStart();
        f = () => Start(false);
    }
    f.BeginInvoke(null, null);
}

\end{verbatim}
\end{document}
